Revit 2026 API

# FabricationCustomDataType Enumeration

---

An enumerated type listing all fabrication custom data value types.

**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum FabricationCustomDataType
```
```vb
Public Enumeration FabricationCustomDataType
```
```cpp
public enum class FabricationCustomDataType
```
```fsharp
type FabricationCustomDataType
```

| Member name | Value | Description |
| --- | --- | --- |
| Integer | 2 | Integer data type |
| Real | 3 | Real number data type. |
| Text | 1 | Text data type |

#### Reference

Autodesk.Revit.DB.Fabrication Namespace